#pragma once

// Radical Heights (ALPHA-0-200211) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "RH_RNR_AnimBlueprint_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// DynamicClass RNR_AnimBlueprint.RnR_AnimBlueprint_C
// 0xDB80 (0xE010 - 0x0490)
class URnR_AnimBlueprint_C : public UShooterCharacterAnimInstance
{
public:
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_B5F5CA944ECF5F2321921FB295C83B05;    // 0x0490(0x0150)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_C48111B0499F571C956C25A1907D8C0B;    // 0x05E0(0x00F0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_67C60E2948AC22D7F9917B8C9BEDD72A;// 0x06D0(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7BDDBC6B4048DD696879098CCA1A224A;// 0x0718(0x00A8)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_CB0937954863F7959354AE8CA7CEB898;    // 0x07C0(0x0150)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8F68BB904649C2C799F3AEB4E9D45170;// 0x0910(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B5441B8F487D1C3C4939338D6F803592;// 0x0990(0x0080)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_01E6E572401B2AA8A8E32F9F2355F60D;// 0x0A10(0x0060)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_EC800D4A47636FA21BE38B9D83C21258;// 0x0A70(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_6FA766AA45764F869401A99D9B292045;// 0x0B20(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_AF148EE24EBCE51471E424A60A2E5DD4;// 0x0B68(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_47DBEB414F374AB8A43DB49107BC8000;// 0x0BB0(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_607613144AED3CB410492FBD379BA112;// 0x0C60(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10590D5D4C4FD8D0B474C6933637767A;// 0x0D10(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_92BD78144BB1B73387B7439EBEDB72CD;// 0x0D80(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_88156EBD49579761E6E510AD90F8647D;// 0x0DF0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7083CF84D9FF7D40825EDB32D813EDD;// 0x0E60(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5ED7938B491850AEF7B7CF9160C652D6;// 0x0ED0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F122658D470C359D1ACF038D59D872B3;// 0x0F40(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E9966960449C1F344E73C68C135AE98D2;// 0x0FB0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BE33E15C42333DA4C1DD93B405DEB3252;// 0x1080(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_154D6BB44FE9E7B2306DD4AE80BBF92E2;// 0x10F0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_984EC9114320F7FDC7D0489BE2BBA2A02;// 0x1160(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C6B2EF824DD1153224B006850887086B2;// 0x11D0(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E85997B8451E0132B2DC6CB3411C0D572;// 0x12A0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0F4FAD284B6ADBDC8DEB64AEEA1D6E032;// 0x1370(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_837957804C6E6078D8DA12B05EE3134A2;// 0x13E0(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_46411DC14343BF591646A1BE4E3B4FA32;// 0x14B0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17022D16438B8A381436898B180D96152;// 0x1580(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7C98640C49A582D8D90364B15E6B54F82;// 0x15F0(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_360C6ECD42782427693A6DBAD63947FA2;// 0x1660(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_30DF6D28425E25D794474294126E8C1F2;// 0x1730(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_5808426D4BEEFD24218A58AB0A3BF15F2;// 0x17A0(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0B3C38D34576F66BBFAE0EA365D84F6B3;// 0x1880(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9D1A9D094AFDB59FE67D719DE18AA4C7;// 0x18C8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1C379A484C6C5F89FBA3948B4453BA15;// 0x1938(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_41BB274A42A692CBEFF0F2B2C0473DC2;// 0x19A8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7198CC46451AC61F70E88EB13A207633;// 0x1A78(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_25333FF448FBF7A710683DB8659793EF;// 0x1AE8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0ED84D2E41B4C6E9279E37B012534B75;// 0x1B58(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_02B78D734C3D154F3181C18B34A9472B;// 0x1C28(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0B3C38D34576F66BBFAE0EA365D84F6B2;// 0x1CF8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FDF8B5A8460DFC9090DC9891CD64FBE3;// 0x1D40(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E9966960449C1F344E73C68C135AE98D;// 0x1DB0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BE33E15C42333DA4C1DD93B405DEB325;// 0x1E80(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_154D6BB44FE9E7B2306DD4AE80BBF92E;// 0x1EF0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_984EC9114320F7FDC7D0489BE2BBA2A0;// 0x1F60(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1CAC533840E15F0068F42C8718A942C3;// 0x1FD0(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C6B2EF824DD1153224B006850887086B;// 0x2040(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3D70B4D3429122413C27A9BB843055B0;// 0x2110(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E85997B8451E0132B2DC6CB3411C0D57;// 0x2180(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0F4FAD284B6ADBDC8DEB64AEEA1D6E03;// 0x2250(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8989F9E54B63BF93DB7ED0B25D450902;// 0x22C0(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_837957804C6E6078D8DA12B05EE3134A;// 0x2330(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_76112A26411AFEBEE547B7A3FC5A0C56;// 0x2400(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_46411DC14343BF591646A1BE4E3B4FA3;// 0x2470(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_17022D16438B8A381436898B180D9615;// 0x2540(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7C98640C49A582D8D90364B15E6B54F8;// 0x25B0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6B4823534AE2C4380E002EB6A327DBB0;// 0x2620(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_360C6ECD42782427693A6DBAD63947FA;// 0x2690(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_30DF6D28425E25D794474294126E8C1F;// 0x2760(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_5808426D4BEEFD24218A58AB0A3BF15F;// 0x27D0(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0B3C38D34576F66BBFAE0EA365D84F6B;// 0x28B0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1EAF988244B3024487A8738AD52A16A5;// 0x28F8(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_9333EC734C3A3C43E2D3E78D1C4EC6F5;// 0x29D0(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3E2B218E4B4F825848B881BE5D52D55F;// 0x2A70(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_441CBD784BFF61C576187CAD268313F9;// 0x2B18(0x0050)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2FF8320F42442959AF1EB18AF71E505E;// 0x2B68(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_EAB85495409718A44627F9BB9C33867C;// 0x2BB0(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4B2BEF4F4870469C9183A1A468B10DD7;// 0x2C58(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1DDFCD2449AD29B0598CDF85921ACC16;// 0x2CA8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0280C37A4D906BA9564774BBB89F246A;// 0x2CF8(0x0050)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DFD544A1442D3773F98DBCB1545968E3;// 0x2D48(0x00B0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_03954423497090FC05E3998C3A591329;// 0x2DF8(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_EE08EE2C438A3B1A4E7597890BBE874E;// 0x2E98(0x00A8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_64C7A69249B5DC309A25559551F56771;      // 0x2F40(0x0060)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_301BEA0241E70A5B6658F085ADFAD9E5;// 0x2FA0(0x0048)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_43FA1D6648450BCEB8FDFBAE00700C9A;  // 0x2FE8(0x0098)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_CBEE6B594790A2B9E07FA28EEB4E97B3;// 0x3080(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_EC6951A3422C7521F0786EAF1AE531D6;// 0x30C8(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_714F78C7406E9BCFC30E5AAE7578C495;// 0x3178(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9D2F483C497A3D54A6761C9FA0824886;// 0x3220(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C6F2BA124B0FD08415C9BD9CF6758364;// 0x3270(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1C4C36AA4CFD0859CC1379B14CEA2A9A;// 0x3310(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A043190B4A57884BD1D039A6D7096894;// 0x3360(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_688EC98D4F2E404497137EA7EDEB41C5;// 0x33D0(0x0078)
	unsigned char                                      UnknownData00[0x8];                                       // 0x3448(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B7DC67E45A31EA3895D7EAD0C6745443;// 0x3450(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E13F6AC44234413A35154092B3ED3ED33;// 0x34D0(0x0080)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3DC23B63430BA76E0156DC90E9EA8576;// 0x3550(0x0120)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4ECE418C435D004E0A6875A1935426FD8;// 0x3670(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DC694A644EE5EB076B6A7E8E4A24E882;// 0x36B8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4ECE418C435D004E0A6875A1935426FD7;// 0x3728(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B0A68E564F15B15273E90990B0C18E9A;// 0x3770(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_FB5BA1B44D5E9206F100BE9E179C6A89;      // 0x3848(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_1F46BEE64842ECE3C2F5F9BA1F325B31;      // 0x38A8(0x0060)
	unsigned char                                      UnknownData01[0x8];                                       // 0x3908(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_1CBECA80454BE430A2464FA923E6699E;    // 0x3910(0x00F0)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_952CC546406F4B2E04510D8E13A23907;    // 0x3A00(0x00F0)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_07EEAA464434338827A348A0CD1B55D7;    // 0x3AF0(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_D23865B2452721A7706F4B9A0B535F91;  // 0x3BE0(0x0098)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_BA80DF7044B288EC1AA661BEA719D6A6;// 0x3C78(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_247075714A01F9C04EFE0C8DABBA2039;// 0x3D20(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_94C091C94AB32DED0DE134BA91E4FE52;// 0x3D70(0x0070)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_AFD7D32A492EA7028BB08B9991D34F4A;      // 0x3DE0(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_52F5D1254507D2FCDB31799D28A6A40B;// 0x3E40(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9BC18D764711764D5A0E6B9BDCD268A2;// 0x3EE8(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4C8EEE854E85D90B71F587826CF29252;// 0x3F38(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_98E4E7D0429F648384BA95AF8F948933;// 0x3FD8(0x0050)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_2CEC834845F3CC2DFC9AA389A5BFA6C7;// 0x4028(0x00E0)
	unsigned char                                      UnknownData02[0x8];                                       // 0x4108(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ADAAC197417A2121C75FB6968FC1F5B8;// 0x4110(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EA24786A43A6CAAFE117A383FCF014FE;// 0x4190(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44957CBB4E1C0D7D1E6B01BBDE7CAC53;// 0x4210(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B7DC67E45A31EA3895D7EAD0C6745442;// 0x4290(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6709447543ED8546080D37BA6EC72FEE;// 0x4310(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D28CCDB6444B575C3AA8248CAE7FAA87;// 0x4390(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FBC8E82D4140CB08E0742DAD6308AC91;// 0x4410(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_289120A64BC6421F29D5F5AFAD394723;// 0x4490(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E13F6AC44234413A35154092B3ED3ED32;// 0x4510(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5F7F270045C31F781B58B39F2FD98281;// 0x4590(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E441E3A44DCC95052B3AD4B9B647B01C;// 0x4610(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B15D220D46ED2417D42E16962C6EA9D2;// 0x4690(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_279D68B34451A9D3F009A2ABADFC200C;// 0x4700(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5903B9D749E04CDAE0C32DA966CE5FB1;// 0x4748(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B72BD1A744E01F9A1E75C4817E609062;// 0x4868(0x0120)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AF4517BF46405E90C3F9D792295BD4D5;// 0x4988(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1185DE5648DFC1ACBFB135926F2793B0;// 0x4A58(0x0120)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0946F56D4B2DBFC7FEA42591C7552902;// 0x4B78(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2E7614F14A9B0F295B8801AF7CC28D91;// 0x4C48(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0174D41246F89A6DC7F3DD8F9C5A60EC;// 0x4D68(0x0120)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_99247A3A41FB16BC555464B912CF6F27;// 0x4E88(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D1FBC64F4E83B6443E41E0BA3264BA57;// 0x4F68(0x0120)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_32BD1FD04AA80439EF67398ED13CFB80;// 0x5088(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4ECE418C435D004E0A6875A1935426FD6;// 0x5158(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D1D6DD094B2FF31DF36955AB4FEDD444;// 0x51A0(0x0120)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CC41F4304DC3E97CDB1AD392B1139646;// 0x52C0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_15D62AAA4F2B7B14140926B5B0093F8D;// 0x5390(0x0120)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4ECE418C435D004E0A6875A1935426FD5;// 0x54B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_68C14905464BE9DFD5338595B33E5DE8;// 0x54F8(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3BBD04884883CE713C6E92BD45188373;// 0x5568(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3BA9CFC24EF126475E9DA4BE9E311B0E;// 0x5648(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_355F4155422DA62FB5205986ACA4248E;// 0x56B8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4ECE418C435D004E0A6875A1935426FD4;// 0x5728(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7DEBE1BC48C99ACD550955928B0F6BA8;// 0x5770(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_A229C13D4E0AE797A0CE35B7AC50A74D;      // 0x5848(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_9525C5BA4867599DA81032B6E7DCC959;      // 0x58A8(0x0060)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_FBED063A47C7DD8BD1EF1BA2709F0332;// 0x5908(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_10F43F7E4F90278E13E980BDA76CD777;// 0x59A8(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B957972043C8D91B21FB2E9D1399D2A2;// 0x5A20(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F1D4FFBC47BE8C3A3ACD43BCAC8ACB96;// 0x5AF0(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0B8F1980499477FA571DA892DA4E3BAC;// 0x5B98(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_10F139D0462A6436A48B6BBE48BB8E74;// 0x5C40(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_89F9678E437002FADAB16289303E611E;// 0x5C90(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_B426496840F477617362BF90D48782F5;      // 0x5CE0(0x0060)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_D555F3DF496168187AF5D3827ED776C6;// 0x5D40(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7FE038744F9BCAF8D1ED5FA3F899A965;// 0x5E20(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DF36CFF44A7937272106CF87ABE9CA2D;// 0x5E90(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2BD92321484A027C617866A17AC88B2E;// 0x5F00(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD0E0706454FA8AA96BD48AD543BBB6B;// 0x5F70(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_B14A2CD54E0E3DFD3EDFDBA0B01CF517;// 0x5FE0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_516DCC424C88E2204AB7A58BA15DE157;// 0x60C0(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2D0F300C41A2B2B8DCCC53B9DAEF1987;// 0x6130(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6577CBE84C32D1848A72C1BE3EEB3EB8;// 0x6180(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_4C40C458441E3480DCADD2BC7909A25B;      // 0x61D0(0x0060)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C93FFC6E411E229B9E0374B6138943B3;// 0x6230(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CEB0CBCD4A435254EF941E93653C67DD;// 0x62D0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2E1E9CAA42EA789F6713459250D08BC4;// 0x6320(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_446175364829E8EF63D3F9AA171634AD;// 0x6370(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CE1B056D4B4B8390002FFF9CCAC2D535;// 0x6418(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_08D6150745ACD5B2C7ED439D76EA8054;      // 0x6468(0x0060)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4EFE0387409A2305906BF39A0EBA0113;// 0x64C8(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_901ECEE6475A8E01451C3490363B09F8;// 0x6568(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7321220644A6C579F1C2EE884145F059;// 0x6610(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_85A2D4004A1690747DA042B178D81A59;// 0x6660(0x0050)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2B02196B42DC9655A9CD8CA87C07FBD0;// 0x66B0(0x00B0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_8F51B8FC4540568AEBB352B7516AFA8E;// 0x6760(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F5CC4FFC44FABBC673F37EB67A137E43;// 0x67A8(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_1E4466D04355C9B19FA167A68A0BBA2D;      // 0x67F0(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5543A57B46E0E2B3D47858B511A6E5D6;// 0x6850(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_516302314122341484A437B14233A70B;// 0x68F8(0x0050)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_776FAF1B43412194CABD3EB4257267FD;// 0x6948(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4CF1FA7549DCFCFBD8179CA8BC7EF3DA;// 0x6990(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_43CD53374BACAF7C996737A9716F2AE4;// 0x69D8(0x0120)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E6FA69484123C5F8BB96C782034A905C;// 0x6AF8(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BAFDA95F4EE78CCF54B286BBEA87EE11;// 0x6B68(0x0120)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4CBEE7514C791E83682837B2758A1B88;// 0x6C88(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A09DCAEF4DEA288D324AC3B689D41A36;// 0x6CF8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2C89DF0C46800C0B23647D8215CB8672;// 0x6D68(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_11EF8AC54D8CF1B67EA0F0AD6B3D0FD4;// 0x6E38(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_431785354A7E7021B7F412AF6F9DAB98;// 0x6F08(0x00D0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_2CDA2AAF4DFEE294C55BED97B57CF57E;// 0x6FD8(0x0078)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_E89DA390450C6A884D550497E6E5D869;      // 0x7050(0x0060)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C381878349B805EE54EEE8A557FAEA07;// 0x70B0(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_09648AB84A8A61BAD394F1A762F84788;// 0x7160(0x00A8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_D807BE61498DF7A80548D0A6F789A6F5;      // 0x7208(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C46AB7EC41BEB986E3E22790B72A1D7D;// 0x7268(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4FD76A7F4F46C9E39B89D583B8596BF5;// 0x72B8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1BCD71D842DFFC1950394B9127D45F7B;// 0x7308(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_B0CB6202457431D5C083C6BAC722CE01;// 0x73D8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_920534F2491373BFDEAC8EA8B1401C09;// 0x7478(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B1F147744240D6A036CC5EAE07CD4766;// 0x74C8(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6B92E35E4E0E72B54E6E119CF2097D56;// 0x7570(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D549D8B049DD29216318DA8F638BAF24;// 0x75C0(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CDAF73C24A4265D74637049D2AD8D67D;// 0x7630(0x0050)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_75C82F15423FCBD3694775B1CBCF88D3;// 0x7680(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8980D6EB47C50797E6B5F8985C233D24;// 0x7700(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EA78156B4DFCF82E830C96B995EA39F6;// 0x7780(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B7DC67E45A31EA3895D7EAD0C674544;// 0x7800(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_083AC561450AD66B8A69F99DE402156F;// 0x7880(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F30AA2A48D2E7527E809BA7E9AB6E94;// 0x7900(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF96EBBD4AF4DDD9481D70952DEA3E99;// 0x7980(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6454DF244E7950049F28A78BC86DE036;// 0x7A00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E13F6AC44234413A35154092B3ED3ED3;// 0x7A80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2BD8DE2849AE3D2A1B20DB9B3A4F9AD5;// 0x7B00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B6860F224BD8D43994735F85AB1AF1FF;// 0x7B80(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BDB3CCDF43A40D7AB1AD46A58BA0ABB3;// 0x7C00(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_470EEFC24F1955512186F3A7CDA8DBED;// 0x7C70(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B1055A904C77578270D004B27BCF8121;// 0x7CB8(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C2C0A15E4AC2104E87A5B8A00F3DB134;// 0x7DD8(0x0120)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_132359754CF4EDA87E0A0F96CA77B242;// 0x7EF8(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_C115F2984655044716FAF3AFEED80248;// 0x7FD8(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_85285F35499E23FA207D5780199CE2EB;// 0x80B8(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1493C246497202D7018901A4D7D6D538;// 0x81D8(0x0120)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_32C61C974D6056173192FE8365D39B47;// 0x82F8(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9FC0D9784FE61906EC830CB04A78D8E4;// 0x83D8(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EF9068634AEBD791C4E5F19838C6A18F;// 0x84F8(0x0120)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4ECE418C435D004E0A6875A1935426FD3;// 0x8618(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1A2245C847FB79B81E8C9BAF9D96792F;// 0x8660(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_D94BE2954731EDB79F47808DBA651598;// 0x86D0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0346DE904475ECBFE5983189872A4FDB;// 0x87B0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_648FEEBE45263B126D4F6290900D4876;// 0x8820(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4ECE418C435D004E0A6875A1935426FD2;// 0x8890(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4B1DAC614B1F83B009C56CB105ED9F64;// 0x88D8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4ECE418C435D004E0A6875A1935426FD;// 0x8928(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_088E15F5490A6B67B61AFDBC5C16B1F5;// 0x8970(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13C973C1492600609DEAD09ED6ACFE88;// 0x8A48(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1D6ED9F14A3DBE2F7E280BAADC521409;// 0x8AB8(0x0078)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_37F09CB346979BCA57DDB28B06293C68;// 0x8B30(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BE839CD24E5320856746BBA488A59335;// 0x8BD8(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_782F76654E45A29F720A489F2EF5D9FB;// 0x8C28(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2F70237045B080E6266D958D49EB7F72;// 0x8CC8(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_422B060B48382C80DA851BA4447DD6A3;// 0x8D70(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9EF691374374E942EDBF65A9A2C0C9B9;// 0x8DC0(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_B8186A0347D3FBDF33509DA5C407F13E;      // 0x8E10(0x0060)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_D6F4A00A4447266D81ED7FABBD0B5D98;// 0x8E70(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E4B69F0A4882038A594DF39BA1DA49AB;// 0x8EE0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3D1455B6416C5A9B02B93CA3FAC010BA;// 0x8F30(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_78E0443248B10D65B3C6E6AE1557C7EA;// 0x8F80(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1B32BD5D4E3C78C223A5A59F32AD6315;// 0x8FD0(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AD8E2DF14B5C38CDFADB8D8F7D263DE3;// 0x9070(0x00A8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5D3532DD4F6ACEA979F7E9ADF82136FA;// 0x9118(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_31DFF3B84CC24E6AFBAC319CC493B7DA;// 0x91B8(0x00A8)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_AB6756B746463382F65361A86FE7A50F;// 0x9260(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_D0772B93439E701A5EEB63AAB5666D74;      // 0x92C0(0x0060)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_D73002674291EF8FE78C269C37469CEB;  // 0x9320(0x0098)
	unsigned char                                      UnknownData03[0x8];                                       // 0x93B8(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_2FC0081F49D2145B54A863A1CA9B4404;    // 0x93C0(0x00F0)
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_69A9038D4C7E66D723EE93821D5C6789;    // 0x94B0(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_BFBD861445FD18099C9C64830FE7165D;  // 0x95A0(0x0098)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_4E8021544E6BD283D0023A97D67878A3;      // 0x9638(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_819085BE40796B493A6EAB8273996E74;// 0x9698(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7860C0524B381DBA85CF369E62E7CF8D;// 0x9708(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E0EB06BB4927C9B194BF8283BDA5B14D;// 0x9778(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EAE64DB74C28B20ED3DE759E3C7072A3;// 0x9848(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3EA5E5B04BA2315896A79EB01953FB50;// 0x9918(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_63E2B3CD4492803C558F9294EDBC0A7A;// 0x99F8(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A0F5D2BF4BD341A841EA6A9709544CF4;// 0x9B18(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BF8368834E28DD69E9087FA5E4AB8877;// 0x9C38(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EC247E864C9566BBAD025C9E2E7A2B97;// 0x9D58(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9ED2B46D4456A60B4F6FE19C65A9D3DA;// 0x9E78(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8FBCC3514CFD82C063EA7BA575A03964;// 0x9F98(0x0120)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BBF092A4484C14A5E42848A69EB62E4A;// 0xA0B8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_30F140A44856280DE0BE279EB9F07AB8;// 0xA128(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_58F8E61A4A0CFFACD7BA589F791E1269;// 0xA1F8(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D19DFEC645B7B9DA0FD016AC1B3318E1;// 0xA268(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_01D139BD4D3D562F101B34A284AA6308;// 0xA388(0x0120)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_23A46B4A45A72B51EA759F8F3805BF25;// 0xA4A8(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3918E43741273983A283FE8A48BB3706;// 0xA588(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F8A4E2444E4172FB61D886ACA6E4AD9D;// 0xA658(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1C7C15F44F45E397DD5500BA2739140A;// 0xA728(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_74A8FEEE49025559D179C1B6A71DE662;// 0xA848(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5B1C2F3643DFE0EC25890C94C58756F1;// 0xA968(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B716156C4CD8279F6840B9A9C3B8E830;// 0xAA88(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AFFA7277413943F9FE0FB39D2DE0EA58;// 0xABA8(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E9362B514D12CB4BB7A20F809CA290A7;// 0xACC8(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0FCFFE2C4123DAF847FB468FF942338F;// 0xADE8(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EA03DD104C7AA914280DC0A906879441;// 0xAF08(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_586DDF324229ACC3E435D5A8EB1FCD0B;// 0xB028(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_74B6037248FFF9BD8FB91DAB9FD614CA;// 0xB148(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2A0B6F7F4DDC6EB49A2F27BE60868097;// 0xB268(0x0120)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BD3589FA4213A0FE5A995DBDC211323C;// 0xB388(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DC67A42A436773875C7EF6B65AD42191;// 0xB458(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_70B4A0234344841E6FB253996CCBCD84;// 0xB4C8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0A1205B54C960BB32659D79B173DBADD;// 0xB5A8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E3227A8749BA08C9E9FC1BBF26B7573B;// 0xB618(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_37D8305C40AAAC0C9963BA9C077F0C8D;// 0xB6E8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90600CB34ABD7ABDB1926C804615E38B;// 0xB7B8(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_A95857164A454E9C02DE7C8A674AF069;// 0xB828(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6DE02AE443237A65F1CD0B96D97E3884;// 0xB908(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90F88C8845D739B63C6D808C0F3483E2;// 0xB978(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D96199C7404CD0130021D783C2488551;// 0xB9E8(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AE0701474B28694F749CD08D28487C3A;// 0xBAB8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_326F871640B0820DD4DA4481663F852C;// 0xBB88(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0AD63B15475248D0B74A28813D8DA627;// 0xBBF8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F73F46B14E750F429624DEB4933F484E;// 0xBCC8(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_D1715DD6493DB3B5231D1696771E536C;// 0xBD38(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_848681154E8284474035D0AE5BF48AC4;// 0xBE18(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_476F8FD044262EBA0F82D1893FCAC666;// 0xBEE8(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_E667517A45693E9F99EE038087AC88B5;// 0xBF58(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0F6552554FA3A690C14530A50700975B;// 0xC038(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B1483E64442F8B8B028F958592DFDE0C;// 0xC108(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C98AABF142EA6957747CDAB01B64B34C;// 0xC228(0x0120)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_19D473FD4704021F1F88E78868923C1D;// 0xC348(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_AE0E182144EDC13C34DBC19755547FB1;// 0xC428(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8624BDC1466BC0B6E31C2B87179F39B7;// 0xC508(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1184179F4D71E451A7AC258EF2FC94AA;// 0xC578(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0FAE52E54414C44D8BE529977CA3F8FD;// 0xC648(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3031B51645216C85B6E4769CE20B1ABC;// 0xC690(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_FDDEA971486541492581359DA9A0653B;      // 0xC768(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D9A6C8BB453822597A29968D3E70313A;// 0xC7C8(0x00A8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_3011F4B3454E93B4D596559434D0CDEE;// 0xC870(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BADB661C414DB62B806B8A98E6283569;// 0xC8B8(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_BE7C805B40E69671A35E6A9308C57B9C;// 0xC968(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6A9FCD7F45D4DAE97E988F9F9A847F48;// 0xC9B0(0x0050)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_D0C216974F2C3EE60935CFB3355D7475;// 0xCA00(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_158F389F41DBD36DEBE49AA514035E1D;// 0xCA60(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F4373BF4AB17FA9C5B87ABD9434A052;// 0xCAD0(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D81A852C468B2AF0906FD6830B2BB895;// 0xCB40(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DB2E9B97490069EDBC30A6A41088DB5D;// 0xCC10(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_Root_F3C46D0746949744B8FCAF8E58009B56;      // 0xCCE0(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_866D3A664F8A6937EF1EDE92E59D03C6;      // 0xCD28(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_02F140EE4AEEFBE7C7DAED9F3EFF3D4F;// 0xCD88(0x0120)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1D26955E4D1ED68D8AB44F86D607CC7B;// 0xCEA8(0x00B0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_101BFD624E6EE5A46FF10880DBD2C1E4;  // 0xCF58(0x0098)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_C38A5EF7493610800583F0A9DD571AFC;  // 0xCFF0(0x0098)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C7021D684C28DBEC1A027A8A6240F8DE;// 0xD088(0x00D0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_FE50688F4FFD62648F701FBB626C821B;// 0xD158(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_CAD63E5A4835BCE966A3F4A11B62A6CE;// 0xD1A0(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_A9CF4F2B4A1BA9886A8219A20626DA6C;// 0xD1E8(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_52EC2ECA457D2C57CAD6C28E34AC5352;// 0xD230(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0D087DB74306365D2635699338F3F646;// 0xD2D8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7BF2488D45CE9D2E12598DAEAC8A404E;// 0xD328(0x0050)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0C577D184DE9C000E4323E91178713EA;// 0xD378(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A63C309F455D7ACD5DF2538EDF1A5713;// 0xD3C0(0x00B0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_51A633AC4078322CC469F68A1838B5DD;  // 0xD470(0x0098)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BDB39E0C4FE592B18884AF98639BBB31;// 0xD508(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_792C27AF4666AE30EAE184B9BE226840;// 0xD5D8(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_679F5BF84A77CAD50727ADB95F2A134D;      // 0xD628(0x0060)
	class AShooterWeapon*                              ShooterWeapon;                                            // 0xD688(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class AShooterCharacter*                           ShooterCharacter;                                         // 0xD690(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class APawn*                                       PawnOwner;                                                // 0xD698(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsFalling;                                                // 0xD6A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0xD6A1(0x0007) MISSED OFFSET
	class AShooterPlayerController*                    PlayerController;                                         // 0xD6A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Pitch;                                                    // 0xD6B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AnimDeltaSeconds;                                         // 0xD6B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Direction;                                                // 0xD6B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Speed;                                                    // 0xD6BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UShooterCharacterMovement*                   MovementComponent;                                        // 0xD6C0(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	struct FVector                                     CharacterVelocity;                                        // 0xD6C8(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FallVelocity;                                             // 0xD6D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CoreSetupComplete;                                        // 0xD6D8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsTargeting;                                              // 0xD6D9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FiredRecently;                                            // 0xD6DA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               EnableLocomotion;                                         // 0xD6DB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EWeaponClass>                          WeaponClass;                                              // 0xD6DC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0xD6DD(0x0003) MISSED OFFSET
	float                                              Yaw;                                                      // 0xD6E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SprintYawAngle;                                           // 0xD6E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SprintLeanAngle;                                          // 0xD6E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsSprinting;                                              // 0xD6EC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsCrouching;                                              // 0xD6ED(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsProne;                                                  // 0xD6EE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               EnableLocomotionAdditive;                                 // 0xD6EF(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EAimState>                             PerspectiveState;                                         // 0xD6F0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0xD6F1(0x0003) MISSED OFFSET
	float                                              IKLeftHandAlpha;                                          // 0xD6F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              IKRightHandAlpha;                                         // 0xD6F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              IKFootAlpha;                                              // 0xD6FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsSprintingAnim;                                          // 0xD700(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0xD701(0x0003) MISSED OFFSET
	float                                              MovementSpeed;                                            // 0xD704(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RealWorldLastFireTime;                                    // 0xD708(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TimeSinceLastFire;                                        // 0xD70C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WorldTimer;                                               // 0xD710(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<ECharacterMovementStance>              Stance;                                                   // 0xD714(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0xD715(0x0003) MISSED OFFSET
	struct FVector                                     CapsuleHeightAdjustment;                                  // 0xD718(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     CapsuleHeightAdjustment_Prone;                            // 0xD724(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     CapsuleHeightAdjustment_Crouch;                           // 0xD730(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bWeaponSwapInProgress;                                    // 0xD73C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0xD73D(0x0003) MISSED OFFSET
	float                                              TurnOnPointCursor;                                        // 0xD740(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     RightEffector;                                            // 0xD744(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     LeftEffector;                                             // 0xD750(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     LeftKnee;                                                 // 0xD75C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     RightKnee;                                                // 0xD768(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              IK_Alpha_R;                                               // 0xD774(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              IK_Alpha_L;                                               // 0xD778(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HipOffset;                                                // 0xD77C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HipOffset_Old;                                            // 0xD780(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     HipTargetOffset;                                          // 0xD784(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     IKRootOffset;                                             // 0xD790(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     WeaponYAxisOffset;                                        // 0xD79C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FVector>                             WeaponYAxisOffsetArray;                                   // 0xD7A8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                              HipOffset_Old_1;                                          // 0xD7B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               SprintLegOutSwitch;                                       // 0xD7BC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               InSprintOutState;                                         // 0xD7BD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData10[0x2];                                       // 0xD7BE(0x0002) MISSED OFFSET
	float                                              StanceLargeBlendTime;                                     // 0xD7C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              StanceSmallBlendTime;                                     // 0xD7C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<ECharacterMovementStance>              StanceLast;                                               // 0xD7C8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData11[0x3];                                       // 0xD7C9(0x0003) MISSED OFFSET
	float                                              StanceBlendTime;                                          // 0xD7CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
